#### RoundingMethod Enumeration

---

|  |
| --- |
| See Also |

Rounding methods

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public enum RoundingMethod ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RoundingMethod ``` |

| Visual C++ |
| --- |
| ``` public enum class RoundingMethod ``` |

# Members

| Member name | Description |
| --- | --- |
| Nearest | Standard rounding: Round to Nearest |
| Up | Round Up |
| Down | Round Down |

# See Also

Autodesk.Revit.DB Namespace